docs/session-7-evidence/performance-round2/load-tests/admin-stats.txt
Running 500 requests test @ http://localhost:3000/api/admin/stats
50 connections


┌─────────┬───────┬───────┬────────┬────────┬─────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg     │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼─────────┼──────────┼────────┤
│ Latency │ 35 ms │ 51 ms │ 139 ms │ 174 ms │ 61.4 ms │ 28.97 ms │ 234 ms │
└─────────┴───────┴───────┴────────┴────────┴─────────┴──────────┴────────┘
┌───────────┬────────┬────────┬────────┬────────┬────────┬───────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%  │ Avg    │ Stdev │ Min    │
├───────────┼────────┼────────┼────────┼────────┼────────┼───────┼────────┤
│ Req/Sec   │ 500    │ 500    │ 500    │ 500    │ 500    │ 0     │ 500    │
├───────────┼────────┼────────┼────────┼────────┼────────┼───────┼────────┤
│ Bytes/Sec │ 136 kB │ 136 kB │ 136 kB │ 136 kB │ 135 kB │ 0 B   │ 136 kB │
└───────────┴────────┴────────┴────────┴────────┴────────┴───────┴────────┘

Req/Bytes counts sampled once per second.
# of samples: 1

0 2xx responses, 500 non 2xx responses
500 requests in 1.01s, 136 kB read