docs/session-7-evidence/performance-round2/load-tests/bookmarks-endpoint.txt
Running 1000 requests test @ http://localhost:3000/api/bookmarks
50 connections


┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 34 ms │ 51 ms │ 307 ms │ 321 ms │ 65.42 ms │ 55.39 ms │ 332 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 326     │ 326     │ 326     │ 674    │ 500    │ 174     │ 326     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 88.4 kB │ 88.4 kB │ 88.4 kB │ 183 kB │ 135 kB │ 47.1 kB │ 88.3 kB │
└───────────┴─────────┴─────────┴─────────┴────────┴────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 2

0 2xx responses, 1000 non 2xx responses
1k requests in 2.01s, 271 kB read