docs/session-7-evidence/performance-round2/load-tests/favorites-endpoint.txt
Running 1000 requests test @ http://localhost:3000/api/favorites
50 connections


┌─────────┬───────┬───────┬───────┬───────┬─────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5% │ 99%   │ Avg     │ Stdev   │ Max    │
├─────────┼───────┼───────┼───────┼───────┼─────────┼─────────┼────────┤
│ Latency │ 32 ms │ 52 ms │ 90 ms │ 95 ms │ 54.9 ms │ 16.2 ms │ 155 ms │
└─────────┴───────┴───────┴───────┴───────┴─────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 132     │ 132     │ 132     │ 868    │ 500    │ 368     │ 132     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 35.8 kB │ 35.8 kB │ 35.8 kB │ 235 kB │ 135 kB │ 99.7 kB │ 35.8 kB │
└───────────┴─────────┴─────────┴─────────┴────────┴────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 2

0 2xx responses, 1000 non 2xx responses
1k requests in 2.02s, 271 kB read