docs/session-7-evidence/performance-round2/load-tests/resources-high-concurrency.txt
Running 2000 requests test @ http://localhost:3000/api/resources?page=1&limit=50
200 connections


┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬───────────┬─────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev     │ Max     │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼───────────┼─────────┤
│ Latency │ 677 ms │ 970 ms │ 1280 ms │ 1303 ms │ 967.15 ms │ 173.45 ms │ 1415 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴───────────┴─────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg     │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Req/Sec   │ 106     │ 106     │ 202     │ 305     │ 200     │ 56.48   │ 106     │
├───────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┼─────────┤
│ Bytes/Sec │ 5.54 MB │ 5.54 MB │ 10.6 MB │ 15.9 MB │ 10.5 MB │ 2.95 MB │ 5.54 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 10

2k requests in 10.02s, 105 MB read