docs/session-7-evidence/performance-round2/load-tests/user-progress-endpoint.txt
Running 1000 requests test @ http://localhost:3000/api/user/progress
50 connections


┌─────────┬───────┬───────┬────────┬────────┬──────────┬─────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev   │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼─────────┼────────┤
│ Latency │ 31 ms │ 54 ms │ 101 ms │ 108 ms │ 57.04 ms │ 19.5 ms │ 155 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 173     │ 173     │ 173     │ 827    │ 500    │ 327     │ 173     │
├───────────┼─────────┼─────────┼─────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 46.9 kB │ 46.9 kB │ 46.9 kB │ 224 kB │ 135 kB │ 88.6 kB │ 46.9 kB │
└───────────┴─────────┴─────────┴─────────┴────────┴────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 2

0 2xx responses, 1000 non 2xx responses
1k requests in 2.01s, 271 kB read